blog/2018-08.org
#+SETUPFILE: ../setup.org
#+TITLE: 2018-8 の進捗まとめ

#+BEGIN_LOCATION
@@html:https://<a href="/">bydriv.github.io</a>/<a href="/blog">blog</a>/<strong>2018-08.html</strong>@@
#+END_LOCATION

#+BEGIN_CREATED_AT
created at @@html:<time datetime="2018-08-31">2018-08-31</time>@@
#+END_CREATED_AT

#+BEGIN_UPDATED_AT
updated at @@html:<time datetime="2018-08-31">2018-08-31</time>@@
#+END_UPDATED_AT

[[./2018-07.org][2018-7 の進捗まとめ]] の続き．

* 2018-08-05 .. 2018-08-14

[[https://github.com/wejournal/lamb][Lamb]] を開発していた．

この時期にやっていたことは，

- Lamb のチュートリアルを書くこと
- リファクタリング
- 諸々のバグ修正
- インライン展開の実装
- サンプルコードの追加

などだろうか．
だいたいの機能は 7月時点でほとんど完成していたけれど，
細かいところを改善した感じ．無意味だったわけではなくて，
致命的なバグもいくつかあったはずだがら，重要な一歩だった．

** 2018-08-06 .. 2018-08-07

Lamb の開発の合間を縫って，
[[./../novel/breath.org][呼吸/Breath]],
[[./../novel/ava-light.org][アヴァ・ライト/Ava Light]],
[[./../novel/ideal-pilot.org][地獄の水先案内人/Ideal Pilot]],
[[./../novel/ghost-in-the-machine.org][こころ/Ghost in the Machine]] という SS も書いていた．

* 2018-08-14 .. 2018-08-16

じつはこのころ， 公開はしていないのだけど，
ブラックジャックのゲームを React でちまちま開発していた．

結果的に， React の基礎知識がついた気がするのでそれはよかった．

* 2018-08-16 .. 2018-08-22

[[./../novel/vixen-sniper.org][妖狐の狙撃手/Vixen Sniper]]
を書いていた．

* 2018-08-23 .. 2018-08-30

[[./../novel/self-existence-of-space.org][宇宙の自存性/Self-Existence of Space]],
[[./../novel/principles-of-formalspeak.org][フォーマルスピークの諸原理/Principles of Formalspeak]],
[[./../novel/2063-04-05.org][2063年4月5日/Apr. 5, 2063]],
[[./../novel/selective-and-transgenic.org][セレクティヴとトランスジェニック/Selective and Transgenic]],
[[./../novel/cotard-delusion.org][コタール症候群/Cotard Delusion]],
[[./../novel/information.org][情報/Information]]
を書いていた．

あと， Lamb に継続を実装した．

* 過去と現在

振り返ってみると， 今年は初めから *なにかしら同人活動を始める* という目標を置いて活動していた．

もちろん， 頒布するものがなければ活動はできないのだけれど．
頒布するものとしてゲームをつくろう，みたいなのもあったが (これはいまでもやりたいが)，
とりあえず最初やるにはちょっと重すぎる目標かもしれない， という感じもあった．
[[./../novel/golden-record.org][黄金録/Golden Record]] を文フリにだそうという話もあった．
ラムダ計算入門を典にだそう， みたいな話もあった．

そのへんの目標はころころ変わっているのだけれど，
なんとなくいまのところ， ラムダ計算実装本はだせそうな感じもする．

技術書典でラムダ計算の本をだそうという話は，
話題が豊富で無理なく続けられると思ったからなのだった．
最初は形式的定義をやろうと思っていたけど，
やっぱり， 理解があやふやまま書くのは危険だ，
ということになり， 処理系本をだすことにしたのである．
といってもラムダ計算を題材にすることに変わりはなく，
その点で， 当初の目標を維持できている， と考えることはできるだろう．

そもそもゲームを頒布しよう，みたいなのは，
ゲームを開発したいというきもちももちろんあったけど，
半分くらいは，プログラミング技術を活かして同人活動をしたい，
ということなのだった．
なので，その意味でも目標は大きく変わっていないと考えてもいいかもしれない．

ゲームのほうは，なんというか，
時間があれば開発できるだろうけど，
ほかのこと（典の原稿や SS とか絵とか）に時間を使いすぎているのが問題で手をつけられていない．
なので，ほんとにゲームの開発に集中しなければならないだろう．
それが難しい．
MHC みたいなのを開発したいというのもあるしね．

そのへんをどうするかみたいなのは今後の課題．
いまのところ， まずは無理なく続けられることをするのが最善手なのでは，という感じがしている．
無理なく続けられるというのは簡単なことというわけじゃなくて，
能力に対して無理なくできること，ということね．

得意なことをやろう，と言ってもいい．
わたしは正直言語処理系にスキルが偏っていて， Web プログラミングも，
GUI プログラミングも素人レベルだという自覚がある．
(まれにそういった分野を "簡単だ" と一蹴するひともいるけれど，
わたしは非常に難しい分野だと認識している．)
たとえば JS の難しさは言語というより，
GUI プログラミングの難しさだ，というふうに考えている．
(言語自体も，それはそれでなかなか難しいのだが．)

ゲーム開発がなかなか進まないのは，
根本的には， GUI プログラミングに対する見識のなさ，
と言ってもいいかもしれない．
たぶん， GUI プログラミングに慣れているひとなら 1 時間もかからずにできることに
数日かかっている感がある． なぜって，必要な機能を調べながら開発しているから，
そりゃ時間もかかるわけである． 一方でそういう経験がなかったら知らない API をたくさん知ることもできたので，
それはそれで無意味な時間ではなかったと思う．

Lamb だって， おそらく言語処理系に慣れていないひとだったら半年や 1 年はかかる機能を含んでいる気がする．
わたしの場合， 何年も勉強を重ねてきたから最初からゴールが見えていた， というのがある．
それがゲーム開発となると， 霧がかかったやみのなかを地図をもたずに進むみたいに，
ゴールも見えないでいる． それが根本的な問題．

言語処理系を開発したとして， それを CD かなにかに焼いて頒布して買ってくれるひとがいるだろうか？
おそらく， わだしだって買わないと思う．
言語処理系を題材にした技術書を書くというのは，
得意分野で勝負できるので， それなりにうまくいきやすいということなのだろう．

そういうわけで得意分野で，いまできることをやろうみたいな方向にシフトしたのが全体としてよかった気がする．

あと， こういう進捗まとめを書いておくと当時なにをしていたのかがあとからわかってけっこういい．
と思いました． わたしのためにね． public な場所に置く意味はあるの？
みたいなのはある．でも， うーん， そのへんはたぶん意味は少なからずあると思う．
いまなにを考えて， どういうことをしてるのか， みたいなことを書いておくと，
けっこう仕事につながったりすることがあるかもしれない．
「わたしはここにいる」というふうに自己の存在をアピールすることは，
生きるために必要な第一のことなのです．

という近況です．
