blog/2018-08.html
<!DOCTYPE html>
<html>
<head>
<title>2018-8 の進捗まとめ</title>
<!-- 2018-08-31 Fri 15:50 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="/css/prelude.css" />
<link rel="stylesheet" type="text/css" href="/css/highlight.css" />
</head>
<body>
<div id="content">
<h1 class="title">2018-8 の進捗まとめ</h1>
<div class="location">
<p>
https://<a href="/">bydriv.github.io</a>/<a href="/blog">blog</a>/<strong>2018-08.html</strong>
</p>

</div>

<div class="created_at">
<p>
created at <time datetime="2018-08-31">2018-08-31</time>
</p>

</div>

<div class="updated_at">
<p>
updated at <time datetime="2018-08-31">2018-08-31</time>
</p>

</div>

<p>
<a href="./2018-07.html">2018-7 の進捗まとめ</a> の続き．
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">2018-08-05 .. 2018-08-14</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="https://github.com/wejournal/lamb">Lamb</a> を開発していた．
</p>

<p>
この時期にやっていたことは，
</p>

<ul class="org-ul">
<li>Lamb のチュートリアルを書くこと
</li>
<li>リファクタリング
</li>
<li>諸々のバグ修正
</li>
<li>インライン展開の実装
</li>
<li>サンプルコードの追加
</li>
</ul>

<p>
などだろうか．
だいたいの機能は 7月時点でほとんど完成していたけれど，
細かいところを改善した感じ．無意味だったわけではなくて，
致命的なバグもいくつかあったはずだがら，重要な一歩だった．
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">2018-08-06 .. 2018-08-07</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Lamb の開発の合間を縫って，
<a href="./../novel/breath.html">呼吸/Breath</a>,
<a href="./../novel/ava-light.html">アヴァ・ライト/Ava Light</a>,
<a href="./../novel/ideal-pilot.html">地獄の水先案内人/Ideal Pilot</a>,
<a href="./../novel/ghost-in-the-machine.html">こころ/Ghost in the Machine</a> という SS も書いていた．
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">2018-08-14 .. 2018-08-16</h2>
<div class="outline-text-2" id="text-2">
<p>
じつはこのころ， 公開はしていないのだけど，
ブラックジャックのゲームを React でちまちま開発していた．
</p>

<p>
結果的に， React の基礎知識がついた気がするのでそれはよかった．
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">2018-08-16 .. 2018-08-22</h2>
<div class="outline-text-2" id="text-3">
<p>
<a href="./../novel/vixen-sniper.html">妖狐の狙撃手/Vixen Sniper</a>
を書いていた．
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">2018-08-23 .. 2018-08-30</h2>
<div class="outline-text-2" id="text-4">
<p>
<a href="./../novel/self-existence-of-space.html">宇宙の自存性/Self-Existence of Space</a>,
<a href="./../novel/principles-of-formalspeak.html">フォーマルスピークの諸原理/Principles of Formalspeak</a>,
<a href="./../novel/2063-04-05.html">2063年4月5日/Apr. 5, 2063</a>,
<a href="./../novel/selective-and-transgenic.html">セレクティヴとトランスジェニック/Selective and Transgenic</a>,
<a href="./../novel/cotard-delusion.html">コタール症候群/Cotard Delusion</a>,
<a href="./../novel/information.html">情報/Information</a>
を書いていた．
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">過去と現在</h2>
<div class="outline-text-2" id="text-5">
<p>
振り返ってみると， 今年は初めから <b>なにかしら同人活動を始める</b> という目標を置いて活動していた．
</p>

<p>
もちろん， 頒布するものがなければ活動はできないのだけれど．
頒布するものとしてゲームをつくろう，みたいなのもあったが (これはいまでもやりたいが)，
とりあえず最初やるにはちょっと重すぎる目標かもしれない， という感じもあった．
<a href="./../novel/golden-record.html">黄金録/Golden Record</a> を文フリにだそうという話もあった．
ラムダ計算入門を典にだそう， みたいな話もあった．
</p>

<p>
そのへんの目標はころころ変わっているのだけれど，
なんとなくいまのところ， ラムダ計算実装本はだせそうな感じもする．
</p>

<p>
技術書典でラムダ計算の本をだそうという話は，
話題が豊富で無理なく続けられると思ったからなのだった．
最初は形式的定義をやろうと思っていたけど，
やっぱり， 理解があやふやまま書くのは危険だ，
ということになり， 処理系本をだすことにしたのである．
といってもラムダ計算を題材にすることに変わりはなく，
その点で， 当初の目標を維持できている， と考えることはできるだろう．
</p>

<p>
そもそもゲームを頒布しよう，みたいなのは，
ゲームを開発したいというきもちももちろんあったけど，
半分くらいは，プログラミング技術を活かして同人活動をしたい，
ということなのだった．
なので，その意味でも目標は大きく変わっていないと考えてもいいかもしれない．
</p>

<p>
ゲームのほうは，なんというか，
時間があれば開発できるだろうけど，
ほかのこと（典の原稿や SS とか絵とか）に時間を使いすぎているのが問題で手をつけられていない．
なので，ほんとにゲームの開発に集中しなければならないだろう．
それが難しい．
MHC みたいなのを開発したいというのもあるしね．
</p>

<p>
そのへんをどうするかみたいなのは今後の課題．
いまのところ， まずは無理なく続けられることをするのが最善手なのでは，という感じがしている．
無理なく続けられるというのは簡単なことというわけじゃなくて，
能力に対して無理なくできること，ということね．
</p>

<p>
得意なことをやろう，と言ってもいい．
わたしは正直言語処理系にスキルが偏っていて， Web プログラミングも，
GUI プログラミングも素人レベルだという自覚がある．
(まれにそういった分野を "簡単だ" と一蹴するひともいるけれど，
わたしは非常に難しい分野だと認識している．)
たとえば JS の難しさは言語というより，
GUI プログラミングの難しさだ，というふうに考えている．
(言語自体も，それはそれでなかなか難しいのだが．)
</p>

<p>
ゲーム開発がなかなか進まないのは，
根本的には， GUI プログラミングに対する見識のなさ，
と言ってもいいかもしれない．
たぶん， GUI プログラミングに慣れているひとなら 1 時間もかからずにできることに
数日かかっている感がある． なぜって，必要な機能を調べながら開発しているから，
そりゃ時間もかかるわけである． 一方でそういう経験がなかったら知らない API をたくさん知ることもできたので，
それはそれで無意味な時間ではなかったと思う．
</p>

<p>
Lamb だって， おそらく言語処理系に慣れていないひとだったら半年や 1 年はかかる機能を含んでいる気がする．
わたしの場合， 何年も勉強を重ねてきたから最初からゴールが見えていた， というのがある．
それがゲーム開発となると， 霧がかかったやみのなかを地図をもたずに進むみたいに，
ゴールも見えないでいる． それが根本的な問題．
</p>

<p>
言語処理系を開発したとして， それを CD かなにかに焼いて頒布して買ってくれるひとがいるだろうか？
おそらく， わだしだって買わないと思う．
言語処理系を題材にした技術書を書くというのは，
得意分野で勝負できるので， それなりにうまくいきやすいということなのだろう．
</p>

<p>
そういうわけで得意分野で，いまできることをやろうみたいな方向にシフトしたのが全体としてよかった気がする．
</p>

<p>
あと， こういう進捗まとめを書いておくと当時なにをしていたのかがあとからわかってけっこういい．
と思いました． わたしのためにね． public な場所に置く意味はあるの？
みたいなのはある．でも， うーん， そのへんはたぶん意味は少なからずあると思う．
いまなにを考えて， どういうことをしてるのか， みたいなことを書いておくと，
けっこう仕事につながったりすることがあるかもしれない．
「わたしはここにいる」というふうに自己の存在をアピールすることは，
生きるために必要な第一のことなのです．
</p>

<p>
という近況です．
</p>
</div>
</div>
</div>
</body>
</html>
